src/DataProcessors/Спец_ОчисткаЛюбойТаблицы/Спец_ОчисткаЛюбойТаблицы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Спец_ОчисткаЛюбойТаблицы</name>
</mdclass:DataProcessor>

src/Catalogs/Спец_СтруктураТаблицБазыДанных/Спец_СтруктураТаблицБазыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спец_СтруктураТаблицБазыДанных</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ВладелецТаблицы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПоследнейОчистки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>9</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоследнейОчистки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Метаданные</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВ1С</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийРазмерТаблицы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринудительноВКэш</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентЗаполнения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерТаблицыБезИндексов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТабличноеПространство</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапросаДляСозданияКопииВременнойТаблицы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧастыеОбращения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Столбцы</name>
    <attributes>
      <name>ИмяСтолбца</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяСтолбцаВ1С</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Метаданные</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипДанных</name>
      <type>
        <types>EnumRef.Спец_ТипыДанныхБазыДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипСоставногоПоля</name>
      <type>
        <types>EnumRef.Спец_ТипыСоставныхПолейБазыДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТипаДанныхДляPostgreSQL</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФункцияПреобразования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>512</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеNull</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Индексы</name>
    <attributes>
      <name>ИмяИндекса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипИндекса</name>
      <type>
        <types>EnumRef.Спец_PostgreSQLТипыИндексов</types>
      </type>
    </attributes>
    <attributes>
      <name>Столбцы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Уникальный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Кластеризован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТабличноеПространство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НеключевыеСтолбцы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Предикаты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерИндекса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ограничения</name>
    <attributes>
      <name>ИмяОграничения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Столбцы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТабличноеПространство</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыХранения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РазмерИндекса</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Кластеризован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Триггеры</name>
    <attributes>
      <name>ИмяТриггера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФункцияТриггера</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредопределенныеДанные</name>
    <attributes>
      <name>ЭлементСсылка</name>
      <type>
        <types>ExchangePlanRef</types>
        <types>EnumRef</types>
        <types>ChartOfCalculationTypesRef</types>
        <types>ChartOfCharacteristicTypesRef</types>
        <types>ChartOfAccountsRef</types>
        <types>CatalogRef</types>
      </type>
    </attributes>
    <attributes>
      <name>ГУИДВБазеДанных</name>
      <comment>Для ссылочных - ГУИД предопределённых данных, для перечислений - обычный ГУИД</comment>
      <type>
        <types>DefinedType.Спец_UID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстовоеПредставлениеОбъекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/Спец_ОчисткаЛюбойТаблицы/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Кэш = Спец_ПолучитьКэш();
	ТипБазы = Спец_ОбщегоНазначенияПовтИсп.СтруктураПараметровБазы().ТипБазыДанных;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураТаблицБазыДанных.Метаданные КАК Метаданные,
	|	СтруктураТаблицБазыДанных.НаименованиеВ1С КАК НаименованиеВ1С
	|ИЗ
	|	Справочник.Спец_СтруктураТаблицБазыДанных КАК СтруктураТаблицБазыДанных
	|ГДЕ
	|	СтруктураТаблицБазыДанных.Метаданные <> """"
	|	И СтруктураТаблицБазыДанных.НаименованиеВ1С <> """"";
	
	ВыборкаРезультат = Запрос.Выполнить().Выбрать();
	Пока ВыборкаРезультат.Следующий() Цикл
		
		МетаданныеОбъекта = Метаданные.НайтиПоПолномуИмени(ВыборкаРезультат.Метаданные);
		Если МетаданныеОбъекта = Неопределено Или Спец_ОбщегоНазначения.ЭтоПеречисление(МетаданныеОбъекта, Кэш) Тогда
			Продолжить;
		КонецЕсли;
		
		РодительМетаданных = МетаданныеОбъекта.Родитель();
		Если СтрЗаканчиваетсяНа(ВыборкаРезультат.НаименованиеВ1С, ".Изменения") Тогда
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(МетаданныеОбъекта, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2 - %3",
				СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
				МетаданныеОбъекта.Представление(),
				"Изменения планов обменов"));
			
		ИначеЕсли ТипЗнч(РодительМетаданных) = Тип("ОбъектМетаданныхКонфигурация") Тогда
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(МетаданныеОбъекта, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2",
					СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
					МетаданныеОбъекта.Представление()));
			
		Иначе
			
			СтруктураПоМетаданным = Спец_ОбщегоНазначения.ПолучитьСтруктуруИмениТипаДанныхОбъекта(РодительМетаданных, Кэш);
			Элементы.ИмяТаблицы.СписокВыбора.Добавить(ВыборкаРезультат.НаименованиеВ1С, СтрШаблон("%1: %2 - %3",
				СтруктураПоМетаданным.ТипОбъектаЕдинственноеЧисло,
				РодительМетаданных.Представление(),
				МетаданныеОбъекта.Представление()));
			
		КонецЕсли;
		
	КонецЦикла;
	
	Элементы.ИмяТаблицы.СписокВыбора.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ИмяТаблицыАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	Спец_РаботаСФормамиКлиент.АвтоПодборТекстаИзСпискаВыбораСтрок(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОчистить(Команда)
	
	Если ПустаяСтрока(ИмяТаблицы) Тогда
		Возврат;
	КонецЕсли;
	
	// ++ Спец_БСП.Версия1С_18_ВышеИлиРавно
	ОчисткаТаблицыАсинх();
	// -- Спец_БСП.Версия1С_18_ВышеИлиРавно
	
	// ++ Спец_БСП.Версия1С_18_Ниже
	////ОчисткаТаблицы();
	// -- Спец_БСП.Версия1С_18_Ниже
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// ++ Спец_БСП.Версия1С_18_ВышеИлиРавно
&НаКлиенте
Асинх Процедура ОчисткаТаблицыАсинх()
	
	Кэш = Спец_ПолучитьКэш();
	Спец_ОбщегоНазначенияКлиент.ВывестиСостояниеАсинх("Очистка таблицы " + ИмяТаблицы);
	
	Элементы.ФормаОчистить.Видимость = Ложь;
	
	Ждать Спец_КомпонентаДополнительныеФункцииКлиент.НачатьЗамерАсинх("ОчисткаТаблицы", Кэш);
	
	УспешноОчищено = Ждать Спец_РаботаСБазойДанныхНапрямуюКлиент.УдалитьДанныеПоОбъекту1СВБазеДанныхАсинх(Новый Массив(), ИмяТаблицы, , Кэш);
	Если Не УспешноОчищено Тогда
		
		Элементы.ФормаОчистить.Видимость = Истина;
		ВызватьИсключение "Не удалось! Возможно, тип базы данных не поддерживается.";
		
	КонецЕсли;
	ВремяВыполнения = Строка(Ждать Спец_КомпонентаДополнительныеФункцииКлиент.ЗавершитьЗамерАсинх("ОчисткаТаблицы", Кэш)) + " сек.";
	
	Элементы.ФормаОчистить.Видимость = Истина;
	
КонецПроцедуры
// -- Спец_БСП.Версия1С_18_ВышеИлиРавно

// ++ Спец_БСП.Версия1С_18_Ниже
////&НаКлиенте
////Процедура ОчисткаТаблицы()
////	
////	Кэш = Спец_ПолучитьКэш();
////	
////	Спец_КомпонентаДополнительныеФункцииКлиентСервер.НачатьЗамер("ОчисткаТаблицы", Кэш);
////	Если Не Спец_РаботаСБазойДанныхНапрямуюКлиентСервер.УдалитьДанныеПоОбъекту1СВБазеДанных(Новый Массив(), ИмяТаблицы, , Кэш) Тогда
////		ВызватьИсключение "Не удалось! Возможно, тип базы данных не поддерживается.";
////	КонецЕсли;
////	ВремяВыполнения = Строка(Спец_КомпонентаДополнительныеФункцииКлиентСервер.ЗавершитьЗамер("ОчисткаТаблицы", Кэш)) + " сек.";
////	
////КонецПроцедуры
// -- Спец_БСП.Версия1С_18_Ниже

#КонецОбласти
